// --створити масив з:
//     - з 5 числових значень
let arrays = [2,41,56.3,400,1324]
console.log(arrays)
// - з 5 стічкових значень
let arrays2 = ['hello', 'world', 'okten', 'school', 'peace'];
console.log(arrays2);
// - з 5 значень стрічкового, числового та булевого типу
let array3 = [30, 'age', false, true, 'Ukraine'];
console.log(array3)
// - та вивести його в консоль
//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let boxes = [];
boxes[0] = 'girl';
boxes[1] = 'true';
boxes[2] = 100500;
boxes[3] = 'victory';
boxes[4] = false;

for (let i = 0; i < boxes.length; i++) {
    const box = boxes[i];
    console.log(box)
}


// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let i = 0;
while (i<arr.length){
    console.log(arr[i]);
    i++;
};

//     2. перебрати його циклом for
for (let number of arr) {
    console.log(number)
}

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
i=0;
while (i<arr.length) {
    if (i % 2 ===1 ) {
        console.log(arr[i]);
    }
    i++
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for (i=0; i< arr.length; i++) {
    if (i % 2 !==0) {
        console.log(arr[i]);
    }
}
// 5. перебрати циклом while та вивести  числа тільки парні  значення

i=0;
while (i < arr.length) {
    if (arr[i] % 2 === 0) {
        console.log(arr[i]);
    }
    i++
}
// 6. перебрати циклом for та вивести  числа тільки парні  значення
for (let i=0; i<arr.length; i++) {
    if (arr[i] % 2 === 0) {
        console.log(arr[i]);
    }
}

// 7. замінити кожне число кратне 3 на слово "okten"
for (let i=0; i<arr.length; i++) {
    if ( arr[i] % 3 === 0) {
        arr[i] = 'okten';

    console.log(arr[i])
//
    }
}

// let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// 8. вивести масив в зворотньому порядку.
for (let j = arr.length - 1; j >= 0; j--) {
    let arrElement = arr[j];
    console.log(arrElement)

}
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор